---
kind: type
id: T:Autodesk.Revit.DB.Architecture.RiserToTreadConnectionOption
source: html/871e2085-3752-a39d-db79-d7257c5c1c0b.htm
---
# Autodesk.Revit.DB.Architecture.RiserToTreadConnectionOption

Represents the connection style of the riser and tread in relation to each other.

## Syntax (C#)
```csharp
public enum RiserToTreadConnectionOption
```